nakhonthai/ESP32IGate/src/main.cpp
void sortPkgDesc(pkgListType a[], int size)
{
    pkgListType t;
    char *ptr1;
    char *ptr2;
    char *ptr3;
    ptr1 = (char *)&t;
    for (int i = 0; i < (size - 1); i++)
    {
        for (int o = 0; o < (size - (i + 1)); o++)
        {
            if (a[o].pkg < a[o + 1].pkg)
            {
                ptr2 = (char *)&a[o];
                ptr3 = (char *)&a[o + 1];
                memcpy(ptr1, ptr2, sizeof(pkgListType));
                memcpy(ptr2, ptr3, sizeof(pkgListType));
                memcpy(ptr3, ptr1, sizeof(pkgListType));
            }
        }
    }
}

void pkgListUpdate(char *call, bool type)
{
    char i = pkgList_Find(call);
    time_t now;
    time(&now);
    if (i != 255)
    { // Found call in old pkg
        pkgList[(uint)i].time = now;
        pkgList[(uint)i].pkg++;
        pkgList[(uint)i].type = type;
        // Serial.print("Update: ");
    }
    else
    {
        i = pkgListOld();
        pkgList[(uint)i].time = now;
        pkgList[(uint)i].pkg = 1;
        pkgList[(uint)i].type = type;
        strcpy(pkgList[(uint)i].calsign, call);
        // strcpy(pkgList[(uint)i].ssid, &ssid[0]);
        pkgList[(uint)i].calsign[10] = 0;
        // Serial.print("NEW: ");
    }
}

bool pkgTxUpdate(const char *info, int delay)
{
    char *ecs = strstr(info, ">");
    if (ecs == NULL)
        return false;
    // Replace
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            if (!(strncmp(&txQueue[i].Info[0], info, info - ecs)))
            {
                strcpy(&txQueue[i].Info[0], info);
                txQueue[i].Delay = delay;
                txQueue[i].timeStamp = millis();
                return true;
            }
        }
    }

    // Add
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active == false)
        {
            strcpy(&txQueue[i].Info[0], info);
            txQueue[i].Delay = delay;
            txQueue[i].Active = true;
            txQueue[i].timeStamp = millis();
            break;
        }
    }
    return true;
}

bool pkgTxSend()
{
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            int decTime = millis() - txQueue[i].timeStamp;
            if (decTime > txQueue[i].Delay)
            {
                #ifdef SA818
                    digitalWrite(POWER_PIN, config.rf_power); //RF Power LOW
                #endif
                APRS_setPreamble(350L);
                APRS_sendTNC2Pkt(String(txQueue[i].Info)); // Send packet to RF
                txQueue[i].Active = false;
#ifdef DEBUG_TNC
                printTime();
                Serial.println("TX->RF: " + String(txQueue[i].Info));
#endif
                return true;
            }
        }
    }
    return false;
}

uint8_t *packetData;
//ฟังชั่นถูกเรียกมาจาก ax25_decode
void aprs_msg_callback(struct AX25Msg *msg)
{
    AX25Msg pkg;

    memcpy(&pkg, msg, sizeof(AX25Msg));
    PacketBuffer.push(&pkg); //ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
}

void printTime()
{
    struct tm tmstruct;
    getLocalTime(&tmstruct, 5000);
    Serial.print("[");
    Serial.print(tmstruct.tm_hour);
    Serial.print(":");
    Serial.print(tmstruct.tm_min);
    Serial.print(":");
    Serial.print(tmstruct.tm_sec);
    Serial.print("]");
}

uint8_t gwRaw[PKGLISTSIZE][66];
uint8_t gwRawSize[PKGLISTSIZE];
int gwRaw_count = 0, gwRaw_idx_rd = 0, gwRaw_idx_rw = 0;

void pushGwRaw(uint8_t *raw, uint8_t size)
{
    if (gwRaw_count > PKGLISTSIZE)
        return;
    if (++gwRaw_idx_rw >= PKGLISTSIZE)
        gwRaw_idx_rw = 0;
    if (size > 65)
        size = 65;
    memcpy(&gwRaw[gwRaw_idx_rw][0], raw, size);
    gwRawSize[gwRaw_idx_rw] = size;
    gwRaw_count++;
}

uint8_t popGwRaw(uint8_t *raw)
{
    uint8_t size = 0;
    if (gwRaw_count <= 0)
        return 0;
    if (++gwRaw_idx_rd >= PKGLISTSIZE)
        gwRaw_idx_rd = 0;
    size = gwRawSize[gwRaw_idx_rd];
    memcpy(raw, &gwRaw[gwRaw_idx_rd][0], size);
    if (gwRaw_count > 0)
        gwRaw_count--;
    return size;
}

#ifdef SA818
unsigned long SA818_Timeout = 0;
void SA818_INIT(uint8_t HL)
{
    Serial.println("SA868 Init");
    pinMode(0, INPUT);
    pinMode(POWER_PIN, OUTPUT);
    pinMode(PULLDOWN_PIN, OUTPUT);
    pinMode(SQL_PIN, INPUT_PULLUP);

    SerialRF.begin(9600, SERIAL_8N1, 14, 13);

    digitalWrite(PULLDOWN_PIN, HIGH);
    digitalWrite(POWER_PIN, LOW);
    delay(500);
    // SerialRF.println("AT+DMOSETVOLUME=2");
    SerialRF.println();
    delay(1000);
    // AT+DMOSETGROUP=1,144.3900,144.3900,0,1,0,0
    // SerialRF.println("AT+DMOSETGROUP=0,145.7625,145.7625,0,1,0,0");
    char str[100];
    if (config.sql_level > 8)
        config.sql_level = 8;
    sprintf(str, "AT+DMOSETGROUP=%01d,%0.4f,%0.4f,%04d,%01d,%04d", config.band, config.freq_tx + ((float)config.offset_tx / 1000000), config.freq_rx + ((float)config.offset_rx / 1000000), config.tone_tx, config.sql_level, config.tone_rx);
    Serial.println(str);
    SerialRF.println(str);
    delay(500);
    // SerialRF.println("AT+DMOAUTOPOWCONTR=1");
    // delay(500);
    if (config.volume > 8)
        config.volume = 8;
    SerialRF.printf("AT+DMOSETVOLUME=%d\r\n", config.volume);
    delay(500);
    // SerialRF.println("AT+DMOSETVOX=0");
    // delay(500);
    // SerialRF.println("AT+DMOSETMIC=1,0,0");
    // delay(500);
    SerialRF.println("AT+SETTAIL=0");
    delay(500);
    // APRS,4FSK
    SerialRF.println("AT+SETFILTER=1,1,1");
    // delay(500);
    // M17
    // SerialRF.println("AT+SETFILTER=0,0,0");
    // delay(100);
    //  AFSK_TimerEnable(true);
    // digitalWrite(POWER_PIN, LOW);
}

void SA818_SLEEP()
{
    digitalWrite(POWER_PIN, LOW);
    digitalWrite(PULLDOWN_PIN, LOW);
    // SerialGPS.print("$PMTK161,0*28\r\n");
    // AFSK_TimerEnable(false);
}

void SA818_CHECK()
{
    while (SerialRF.available() > 0)
        SerialRF.read();
    SerialRF.println("AT+DMOCONNECT");
    delay(100);
    if (SerialRF.available() > 0)
    {
        String ret = SerialRF.readString();
        if (ret.indexOf("DMOCONNECT") > 0)
        {
            SA818_Timeout = millis();
#ifdef DEBUG
            // Serial.println(SerialRF.readString());
            Serial.println("SA818 Activated");
#endif
        }
    }
    else
    {
        Serial.println("SA818 deActive");
        digitalWrite(POWER_PIN, LOW);
        digitalWrite(PULLDOWN_PIN, LOW);
        delay(500);
        SA818_INIT(LOW);
    }
    // SerialGPS.print("$PMTK161,0*28\r\n");
    // AFSK_TimerEnable(false);
}
#endif
// #ifdef SA818
// unsigned long SA818_Timeout = 0;
// void SA818_INIT(uint8_t HL)
// {

//     pinMode(0, INPUT);
//     pinMode(POWER_PIN, OUTPUT);
//     pinMode(PULLDOWN_PIN, OUTPUT);
//     pinMode(SQL_PIN, INPUT_PULLUP);

